Repository: drupalprojects/webform
Catalog: po/*.po
Languages: fr

source: Webforms are forms and questionnaires. To add one select <strong>create content -&gt; webform</strong>. Below you can set different security and debug options.
fr: Les webforms sont des formulaires et des questionnaires. Pour en ajouter un sélectionner <strong>Créer un contenu &gt; webform</strong>. Vous pouvez définir diverses options de sécurité et de débogage ci-dessous.

source: <p>This module lets you create forms or questionnaires and define there content. Submissions from these forms are stored in the database and optionaly also send by e-mail to a predefined address.</p> <p>Here is how to create one: <ul> <li>Go to Create Content and add a webform</li> <li>Add a description that is displayed as a teaser and above the actual form.</li> <li>Add a confirmation message or redirect node that is to be displayed after a successful submission.</li> <li>Select which roles who should have submission access to this form (roles that have the &quot;use all webforms&quot; permision can allways use a webform).</li> <li>Add one or more components to your form.</li> <li>Optionaly add a email address to which submissions will be send. If no email address is specified no email will be send when submissions are made through the form.</li> <li>Optionally select an email component that will be used to populate the return email address on any sent email.</ul> <li>Optionally select a textfield component that will be used to populate the subject email field on any sent email.</ul> </ul> Help on adding and how to configure the components will be shown after adding your first component. </p> <p>On user submissions the form content is stored in the database table <i>webform_submitted_data</i> as key-value pairs. Apart from the form fields the following &quot;special&quot; fields are added: <ul> <li> __userid : UID of the submiting user.</li> <li> __timestamp : UNIX timestamp for when the submission occured.</li> <li> __remotehost : IP or name of the remote host from which the submission came.</li> <li> __useragent : What user agent (browser) the user used upon submitting the data.</li> </ul>
fr: <p>Ce module permet de créer des formulaires ou des questionnaires et de définir leur contenu. Les données soumises à ces formulaires sont stockées dans la base de données et peuvent optionnellement être envoyées par courriel à une adresse prédéfinie.</p> <p>Voici comment en créer un&nbsp;: <ul> <li>Dans Créer un contenu, ajoutez un webform.</li> <li>Entrez une description qui sera affichée comme résumé et au-dessus du formulaire.</li> <li>Entrez un message de confirmation ou une redirection vers un n&oelig;ud qui sera affiché après une soumission réussie.</li> <li>Sélectionnez les rôles qui auront l'autorisation de soumettre des données à votre formulaire (les rôles qui ont la permission &quot;utiliser tous les webform&quot; peuvent toujours utiliser un webform).</li> <li>Ajoutez les composants de votre webform.</li> <li>Facultativement, ajoutez une adresse de courriel à laquelle les soumissions seront envoyées. Si aucune adresse n'est spécifiée, aucun courriel ne sera émis lorsqu'un formulaire sera soumis.</li> <li>Facultativement, sélectionnez un champ texte pour la valeur du champ sujet des courriels envoyés.</li> </ul> De l'aide sur la manière d'ajouter et de configurer les composants du formulaire sera affichée après avoir ajouté le premier de ceux-ci.</p> <p>Lors de la soumission d'un formulaire, les données saisies sont stockées dans la base de données, dans la table <i>webform_submitted_data</i> sous forme de paires clef/valeur. En plus des valeurs des champs du formulaire, les champs &quot;spéciaux&quot; suivants sont également stockés&nbsp;: <ul> <li>__userid&nbsp;: UID de l'utilisateur qui a rempli le formulaire.</li> <li>__timestamp&nbsp;: horodatage de la soumission au format Unix.</li> <li>__remotehost&nbsp;: adresse IP ou nom de la machine depuis laquelle le formulaire a été soumis.</li> <li>__useragent&nbsp;: identification du client web utilisé pour la soumission du formulaire.</li> </ul>

source: Enables the creation of forms and questionnaires.
fr: Permet de créer des formulaires et des questionnaires

source: A webform can be a questionnaires, contact or request forms. It can be used to let visitors make contact, register for a event or to enable a complex survey.
fr: Un webform peut être un questionnaire, un formulaire de contact ou de demande. Il peut être utilisé pour que les visiteurs prennent contact, s'inscrivent à un événement ou prennent part à un sondage complexe.

source: Available variables are: %username, %useremail, %site, %date.
fr: Les variables disponibles sont&nbsp;: %username, %usermail, %site, %date

source: You can also use %server[key] to add any of the special PHP <a href="http://www.php.net/reserved.variables#reserved.variables.server">$_SERVER</a> variables and %get[key] to create prefilled forms from from the <a href="http://www.php.net/reserved.variables#reserved.variables.get">URL</a>.
fr: Vous pouvez également utiliser %server[key] pour ajouter n'importe laquelle des variables spéciales PHP <a href="http://www.php.net/reserved.variables#reserved.variables.server">$_SERVER</a> pour créer des formulaires pré-remplis depuis <a href="http://www.php.net/reserved.variables#reserved.variables.get">URL</a>.

source: If you are using the profiles module, you can also access all profile data using the syntax %profile[form_name]. If you for example have a profile value named profile_city, add the varible %profile[profile_city].
fr: Si vous utilisez le module profiles, vous pouvez également accéder aux données de tous les profils en utilisant la syntaxe %profile[nom_formulaire]. Par exemple, si vous avez un nom de profil comme profil_ville, ajoutez la variable %profile[profil_ville].

source: Update from version %a to version %b
fr: Mettre à jour de la version %a à la version %b

source: Allow cross site posting
fr: Autoriser l'écriture trans-site (cross-site posting)

source: Yes
fr: Oui

source: No
fr: Non

source: Allow postings to your webforms that do not originate from your site's domain.
fr: Autoriser les soumissions à vos formulaires n'émanant pas du domaine de votre site.

source: Webforms Debug
fr: Débogage des webform

source: DEBUG for the webform module
fr: Débogage pour le module webform.

source: Set this option to "Log submissions" to log all submissions in the watchdog. Set it to "Full debug" to print debug info on submission. You probably want to leave this option on "OFF".
fr: Réglez cette option sur &quot;Log submissions&quot; pour conserver une trace de toutes les soumissions dans les journaux de Drupal (watchdog). Réglez-la sur &quot;Full debug&quot; pour afficher des informations de debogage lors de la soumission. Vous préférerez probablement laisser cette option sur &quot;OFF&quot;.

source: Show main webform menu
fr: Afficher le menu principal de webform

source: Select the visibility of the main webform item on the main menu
fr: Visibilité de l'élément webform dans le menu principal.

source: The form component has been changed. Remember to press Submit on the bottom of this form to save your changes.
fr: Le composant du formulaire a été modifié. N'oubliez pas d'utiliser le bouton Soumettre au bas de ce formulaire pour sauvegarder vos modifications.

source: The form component has been deleted. Remember to press Submit on the bottom of this form to save your changes.
fr: Le composant du formulaire a été supprimé. N'oubliez pas d'utiliser le bouton Soumettre au bas du formulaire pour enregistrer vos modifications.

source: You have to specify a form description.
fr: Vous devez saisir la description de votre formulaire.

source: You have to specify a confirmation message.
fr: Vous devez saisir un message de confirmation.

source: Webform upgrade page
fr: Page de mise à jour de webform

source: results
fr: résultats

source: go to form
fr: aller au formulaire

source: View this form.
fr: Afficher ce formulaire.

source: Go back to the form
fr: Revenir au formulaire

source: textfield
fr: champ texte

source: textarea
fr: zone de texte

source: select
fr: sélection

source: label
fr: étiquette

source: hidden
fr: caché

source: e-mail address
fr: adresse de courriel

source: Use access
fr: Accès d'utilisation

source: Roles that should be able to submit data using this form.
fr: Rôles ayant l'autorisation de soumettre des données via ce formulaire.

source: Text to be shown as teaser and before the form.
fr: Texte à afficher comme résumé et avant le formulaire.

source: Confirmation message or redirect URL
fr: Message de confirmation ou URL de redirection.

source: Message to be shown upon successful submission or an absolute path to a redirect page (must start with http://)
fr: Message à afficher lors de la soumission réussie du formulaire ou chemin absolu d'une page de redirection (doit commencer par http://).

source: To edit a component, check its "selected" box and press "Edit selected".
fr: Pour éditer un élément, cochez sa case de sélection et cliquez sur &quot;Éditer sélectionnés&quot;.

source: To delete a component, check its "selected" box and press "Delete selected".
fr: Pour supprimer un élément, cochez sa case de sélection et cliquez sur &quot;Supprimer sélectionnés&quot;.

source: Use "value" to enter a default value.
fr: Utilisez &quot;valeur&quot; pour entrer une valeur par défaut.

source: Check "mandatory" box if the field should be mandatory.
fr: Cochez la case &quot;Obligatoire&quot; si ce champ doit obligatoirement être rempli.

source: Remember to set weight on the components or they will be added to the form in a random order.
fr: N'oubliez pas de spécifier le poids des divers éléments, sinon ils seront insérés dans le formulaire dans un ordre aléatoire.

source: The components are sorted first by weight and then by name.
fr: Les éléments sont triés par poids, puis par nom.

source: Form components
fr: Éléments du formulaire

source: Select
fr: Sélectionner

source: Name
fr: Nom

source: Value
fr: Valeur

source: Mandatory
fr: Obligatoire

source: Weight
fr: Poids

source: Edit selected
fr: Éditer la sélection

source: Delete selected
fr: Supprimer la sélection

source: Add a new component
fr: Ajouter un nouvel élément

source: Select a component type to add.
fr: Choisir un type d'élément à ajouter

source: Add
fr: Ajouter

source: E-mail to address
fr: Adresse de destination

source: Form submissions will be e-mailed to this address. Leave blank for none.
fr: Les soumissions seront envoyées à cette adresse. Laissez le champ vide pour ne pas envoyer de courriel.

source: E-mail from address
fr: Adresse d'origine des courriels (champ From).

source: Form e-mails will have this return address. Choose Automatic for the default
fr: Les courriels auront cette adresse de retour. Choisissez Automatique pour la valeur par défaut.

source: E-mail subject
fr: Sujet du courriel

source: Form e-mails will have this subject line. Choose Automatic for the default
fr: Les courriels du formulaire auront ce sujet. Choisissez Automatique pour la valeur par défaut.

source: Unauthorized webform access attempt
fr: Tentative d'accès non autorisé à un webform

source: Preview
fr: Aperçu

source: Submit
fr: Soumettre

source: Page called out of order
fr: Page affichée hors de séquence

source: Name of the field. This is used as a descriptive label and as the key when saving data in the database.
fr: Nom du champ. Ce nom est utilisé comme description et comme clef pour sauver les données dans la base de données.

source: A short description of the field used as help for the user when he/she uses the form.
fr: Une courte description du champ, utilisée pour aider l'utilisateur à remplir le formulaire.

source: Default value
fr: Valeur par défaut

source: The default value of a email field is always the users email address if he/she is logged in.
fr: La valeur par défaut du champ courriel est toujours l'adresse de l'utilisateur lorsqu'il est connecté via son compte.

source: Width
fr: Largeur

source: Width of the textfield.
fr: Longueur du champ de texte.

source: The default value of the field.
fr: La valeur par défaut du champ.

source: The value of the field.
fr: La valeur du champ.

source: The default value of the area.
fr: La valeur par défaut de la zone.

source: Width of the textarea.
fr: Largeur de la zone de texte.

source: Height
fr: Hauteur

source: Height of the textarea.
fr: Hauteur de la zone de texte.

source: Enter one option per line.
fr: Saisissez une option par ligne.

source: The preselected value.
fr: La valeur présélectionnée.

source: Check this option if the user should be allowed to choose multiple values.
fr: Cochez cette option si l'utilisateur peut choisir plusieurs valeurs.

source: Listbox
fr: Liste déroulante

source: Check this option if you want the select component to be of listbox type instead of radiobuttons or checkboxes.
fr: Cochez cette option si vous voulez que l'élément soit présenté comme une liste déroulante plutôt qu'une suite de boutons radio ou des cases à cocher.

source: Done
fr: Terminé

source: Warning: This button will accept your changes as sub-part of the edit. You will still have to select <b>'submit'</b> on the next screen to make your changes permanent.
fr: Attention&nbsp;: Ce bouton va enregistrer vos modifications de manière temporaire. Vous devrez encore sélectionner <b>Soumettre</b> sur l'écran suivant pour rendre vos modifications permanentes.

source: Trying to post to webform from external domain.
fr: Tentative d'utilisation d'un webform depuis un domaine externe.

source: Visit referer
fr: Afficher le référant

source: You are not allowed to post to this form from an external domain.
fr: Vous n'êtes pas autorisé à utiliser ce formulaire depuis un domaine externe.

source: You are not allowed to submit data using this form.
fr: Vous n'êtes pas autorisé à saisir des données dans ce formulaire.

source: Form submission from:
fr: Formulaire soumis par :

source: Submission posted to
fr: Formulaire soumis à

source: You have not completed the form. %s is a mandatory field.
fr: Vous n'avez pas complété le formulaire. %s est un champ obligatoire.

source: Submitted on
fr: Soumis le

source: Submitted by user
fr: Soumis par

source: Submitted by anonymous user
fr: Soumis par un visiteur

source: Submitted values are:
fr: Les données saisies sont :

source: Go back
fr: Retour

source: maintain webforms
fr: entretien des webforms

source: create webforms
fr: créer des webforms

source: use all webforms
fr: utiliser tous les webforms

source: Title
fr: Titre

source: View
fr: Voir

source: Operations
fr: Opérations

source: Do you really want to delete all submissions for this form?
fr: Voulez-vous vraiment supprimer toutes les soumissions pour ce formulaire ?

source: Do you really want to delete <strong>all</strong> submissions for this form?
fr: Voulez-vous vraiment supprimer <strong>toutes</strong> les soumissions pour ce formulaire ?

source: This action cannot be undone.
fr: Cette action ne pourra pas être annulée.

source: Do you really want to delete this form submission?
fr: Voulez-vous vraiment supprimer cette soumission du formulaire ?

source: User
fr: Utilisateur

source: Delete
fr: Supprimer

source: Unique Users Only
fr: Utilisateurs uniques seulement

source: Unique IPs Only
fr: Adresses IP uniques seulement

source: Analog Bar
fr: Barre analogique

source: Percentage
fr: Pourcentage

source: Tallies
fr: Comptes

source: Covariance Matrix
fr: Matrice de covariance

source: choice
fr: choix

source: responses
fr: réponses

source: Left Blank
fr: Laissé vide

source: Default
fr: Par défaut

source: User entered value
fr: Valeur saisie par l'utilisateur

source: Average submission length in words (ex blanks)
fr: Taille moyenne, en mots, des données saisies (hors blancs)
